{
  "themes": [
    {
      "id": 1,
      "title": "HTML",
      "desc": "HTML - основа каждой веб- страницы, независимо от сложности сайта или количества задействованных технологий. Это важный навык для любого веб-профессионала и отправная точка для всех, кто имеет отношение к созданию или редактированию контента в Интернете.HTML отображает язык разметки гипертекста. «Язык разметки» означает, что HTML использует теги для идентификации различных типов контента и целей, которые каждый преследует на веб-странице.Для разметки разметки используются HTML-теги, также известные как «элементы». Они имеют довольно интуитивные типы: заголовки, теги абзацев, теги изображений и т. д. ",
      "img": "https://docs.google.com/drawings/u/0/d/sRaWSmLPWaBe-Q2e-C03pVg/image?w=651&h=287&rev=1&ac=1&parent=12QhJklYDltblewgxPw9Bxp5UesdWu1LcVV526VxeKwQ"
    },
    {
      "id": 2,
      "title": "CSS",
      "desc": "(Cascading Style Sheets) — это код, который вы используете для стилизации вашей веб-страницы.",
      "img": "https://armyyazilim.com/wp-content/uploads/2019/10/css.png"
    },
    {
      "id": 3,
      "title": "Vanilla JS",
      "desc": "Что такое JavaScript?Изначально JavaScript был создан, чтобы «сделать веб-страницы живыми».Программы на этом языке называются скриптами. Они могут встраиваться в HTML и выполняться автоматически при загрузке веб-страницы.Скрипты распространяются и выполняются, как простой текст. Им не нужна специальная подготовка или компиляция для запуска.Это отличает JavaScript от другого языка – Java.",
      "img": "https://astwellsoft.com/assets/images/blog/javascript.jpg"
    },
    {
      "title": "Bootstrap",
      "desc": "Bootstrap — это открытый и бесплатный HTML, CSS и JS фреймворк, который используется веб-разработчиками для быстрой вёрстки адаптивных дизайнов сайтов и веб-приложений.Основная область его применения – это фронтенд разработка сайтов и интерфейсов админок. Среди аналогичных систем (Foundation, UIkit, Semantic UI, InK и др.) фреймворк Bootstrap является самым популярным.Почему Bootstrap так популярен? Это связано с тем, что он позволяет верстать сайты в несколько раз быстрее, чем это можно выполнить на «чистом» CSS и JavaScript. А в нашем мире время – это очень ценный ресурс. Кроме этого, его популярность ещё обусловлена доступностью. Она заключается в том, что на нём даже начинающий разработчик может верстать достаточно качественные макеты, которые трудно было бы выполнить без глубоких знаний веб-технологий и достаточной практики.Фреймворк Bootstrap представляет собой набор CSS и JavaScript файлов. Чтобы его использовать эти файлы необходимо просто подключить к странице. После этого вам станут доступны инструменты данного фреймворка: колоночная система (сетка Bootstrap), классы и компоненты.",
      "img": "https://getbootstrap.ru/docs/4.5/assets/brand/bootstrap-social.png",
      "id": 1618382209773
    },
    {
      "title": "Native script (NS)",
      "desc": ">Native script (NS) – это библиотека, позволяющая делать кросс-платформенные приложения, используя XML, CSS, JavaScript. Native script решает ту же задачу, что и уже всем известный phonegap (создание кросс-платформенных приложений), но подходы у них разные. Phonegap использует движок браузера, чтобы отобразить ваш UI (фактически вы получаете веб-страницу), Native script использует нативный рендеринг, использует элементы нативного UI. Следующее важное отличие: чтобы получить доступ к камере, gps и так далее в phonegap необходимо устанавливать плагины, в то время как NS дает доступ из коробки.",
      "img": "https://habrastorage.org/files/c51/541/e1f/c51541e1f1194eccbfc707fe43464d7a.jpg",
      "id": 1618382243094
    },
    {
      "title": "DOM-дерево",
      "desc": ">DOM-дерево Основой HTML-документа являются теги. В соответствии с объектной моделью документа («Document Object Model», коротко DOM), каждый HTML-тег является объектом. Вложенные теги являются «детьми» родительского элемента. Текст, который находится внутри тега, также является объектом.",
      "img": "https://itchief.ru/assets/images/javascript/dom/1.png",
      "id": 1618382264054
    },
    {
      "title": "React",
      "desc": "React (иногда React.js или ReactJS) — JavaScript-библиотека[4] с открытым исходным кодом для разработки пользовательских интерфейсов. React разрабатывается и поддерживается Facebook, Instagram и сообществом отдельных разработчиков и корпораций[5][6][7]React может использоваться для разработки одностраничных и мобильных приложений. Его цель — предоставить высокую скорость, простоту и масштабируемость. В качестве библиотеки для разработки пользовательских интерфейсов React часто используется с другими библиотеками, такими как MobX, Redux и GraphQL[8].",
      "img": "https://miro.medium.com/max/3260/1*CeuWv9fCjD1uTiTuKytnBQ.png",
      "id": 1618382285557
    },
    {
      "title": "Хуки",
      "desc": "Хуки — нововведение в React 16.8, которое позволяет использовать состояние и другие возможности React без написания классов.",
      "img": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS2FzZO3tHKd-FRlkCwaljYce5Bn1jBOLyprQ&usqp=CAU",
      "id": 1618382313437
    },
    {
      "title": "jQuery",
      "desc": ">jQuery — набор функций JavaScript, фокусирующийся на взаимодействии JavaScript и HTML. Библиотека jQuery помогает легко получать доступ к любому элементу DOM, обращаться к атрибутам и содержимому элементов DOM, манипулировать ими. Также библиотека jQuery предоставляет удобный API для работы с AJAX.",
      "img": "https://habrastorage.org/files/a33/fac/434/a33fac4347e54ed280e4a1e8460289f5.png",
      "id": 1618382325710
    }
  ],
  "comments": [
    {
      "id": 1,
      "body": "some comment",
      "postId": 1
    }
  ],
  "profile": {
    "name": "typicode"
  }
}